99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_nan/esp32_mquickjs_wifi_nan.c
#include "esp32_mquickjs_wifi_nan.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && (CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE)
#include "esp32_mquickjs_wifi_nan_session.h"
#include "esp32_mquickjs_wifi_nan_tx.h"
#include "esp32_mquickjs_wifi_nan_discovery.h"
#include "esp32_mquickjs_wifi_nan_message.h"
#include "esp32_mquickjs_wifi_nan_path.h"
#include "esp32_mquickjs_wifi_nan_pairing.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp_nan.h"

typedef enum { NAN_READY, NAN_CLOSE, NAN_SERVICE_READY, NAN_SERVICE_CLOSE, NAN_SERVICE_SEND,
    NAN_PATH_RECEIVE, NAN_PATH_READY, NAN_PATH_CLOSE, NAN_PATH_RESPOND, NAN_PAIRING_READY, NAN_PAIRING_CLOSE, NAN_PAIRING_CREDENTIALS, NAN_PAIRING_RECEIVE } nan_operation_t;
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
typedef struct { bool accept; uint16_t length; uint8_t ssi[ESP_WIFI_MAX_SVC_SSI_LEN]; } nan_path_response_t;
#endif

struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_wifi_nan_session_t *session;
    esp32_mquickjs_wifi_nan_discovery_t *discovery;
    esp32_mquickjs_wifi_nan_message_t *message;
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    esp32_mquickjs_wifi_nan_path_t *path;
    nan_path_response_t *response;

#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
    esp32_mquickjs_wifi_nan_pairing_t *pairing;
    esp32_mquickjs_wifi_nan_credentials_t credentials;
    uint32_t credentials_revision;
    esp_err_t credentials_error;
    bool credentials_ready;
#endif
    nan_operation_t operation;
    uint32_t timeout_ms;
    bool cancelled;
};
#define SET(object, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; } while (0)

static const char *nan_operation_name(nan_operation_t operation)
{
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (operation == NAN_PATH_RECEIVE) return "WiFiNanService.receiveDataPath";
    if (operation == NAN_PATH_READY) return "WiFiNanDataPath.ready";
    if (operation == NAN_PATH_CLOSE) return "WiFiNanDataPath.close";
    if (operation == NAN_PATH_RESPOND) return "WiFiNanDataPath.respond";

#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
    if (operation == NAN_PAIRING_RECEIVE) return "WiFiNanService.receivePairing";
    if (operation == NAN_PAIRING_CREDENTIALS) return "WiFiNanService.pairingCredentials";
    if (operation == NAN_PAIRING_READY) return "WiFiNanPairing.ready";
    if (operation == NAN_PAIRING_CLOSE) return "WiFiNanPairing.close";
#endif
    if (operation == NAN_SERVICE_READY) return "WiFiNanService.ready";
    if (operation == NAN_SERVICE_CLOSE) return "WiFiNanService.close";
    if (operation == NAN_SERVICE_SEND) return "WiFiNanService.send";
    return operation == NAN_CLOSE ? "WiFiNanSession.close" : "WiFiNanSession.ready";
}

static esp32_mquickjs_wifi_nan_session_t *nan_receiver(JSContext *ctx, JSValue value)
{
    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_NAN_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiNanSession");
        return NULL;
    }
    esp32_mquickjs_wifi_nan_session_t *session = JS_GetOpaque(ctx, value);
    if (!session) JS_ThrowReferenceError(ctx, "invalid WiFiNanSession");
    return session;
}

void js_wifi_nan_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    /* Futures are independent native owners. The last external release asks
     * the registry to close; no JS root is needed by the worker or observer. */
    esp32_mquickjs_wifi_nan_session_release(opaque);
}

JSValue js_wifi_nan_constructor(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.nan.open()");
}

static JSValue nan_status_to_js(JSContext *ctx, const esp32_mquickjs_wifi_nan_session_status_t *s)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "identity", JS_NewUint32(ctx, s->identity));
    SET(result, "mode", JS_NewString(ctx, s->usd ? "unsynchronized" : "synchronized"));
    SET(result, "state", JS_NewString(ctx, s->retired ? "closed" : s->closing ? "closing" : s->ready ? "ready" : "opening"));
    SET(result, "operation", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.identity) : JS_NULL);
    SET(result, "radioGeneration", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.generation) : JS_NULL);
    SET(result, "activated", JS_NewBool(s->activated));
    SET(result, "workerBusy", JS_NewBool(s->worker_busy));
    SET(result, "ready", JS_NewBool(s->ready));
    SET(result, "closeRequested", JS_NewBool(s->closing));
    SET(result, "cleanupPending", JS_NewBool(s->closing && !s->retired));
    SET(result, "timedOut", JS_NewBool(s->timed_out));
    SET(result, "nativeStartSeen", JS_NewBool(s->native_start_seen));
    SET(result, "nativeStopSeen", JS_NewBool(s->native_stop_seen));
    SET(result, "groupManagementProtection", JS_NewBool(s->group_management_protection));
    SET(result, "startAttempted", JS_NewBool(s->native.start_attempted));
    SET(result, "startAccepted", JS_NewBool(s->native.start_accepted));
    SET(result, "stopped", JS_NewBool(s->native.stopped));
    SET(result, "nativeReset", JS_NewBool(s->native.native_reset));
    SET(result, "netifRetired", JS_NewBool(s->native.netif_retired));
    SET(result, "observerRetired", JS_NewBool(s->native.observer_retired));
    SET(result, "modeRestored", JS_NewBool(s->native.mode_restored));
    SET(result, "storageRestored", JS_NewBool(s->native.storage_restored));
    SET(result, "reservedBytes", JS_NewUint32(ctx, s->reserved_bytes));
    SET(result, "error", s->error ? JS_NewInt32(ctx, s->error) : JS_NULL);
    SET(result, "stage", s->stage ? JS_NewString(ctx, s->stage) : JS_NULL);
    SET(result, "nativeStage", s->native.stage ? JS_NewString(ctx, s->native.stage) : JS_NULL);
    SET(result, "cleanupError", s->cleanup_error ? JS_NewInt32(ctx, s->cleanup_error) : JS_NULL);
    SET(result, "cleanupStage", s->cleanup_stage ? JS_NewString(ctx, s->cleanup_stage) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

