99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_nan/esp32_mquickjs_wifi_nan.c
static JSValue nan_error(JSContext *ctx, const char *operation,
    esp32_mquickjs_wifi_nan_session_t *session, esp_err_t error, bool wait_timeout)
{
    esp32_mquickjs_wifi_nan_session_status_t status = {0};
    if (session) (void)esp32_mquickjs_wifi_nan_session_status(session, &status);
    if (error == ESP_OK) error = status.error ? status.error : ESP_ERR_INVALID_STATE;
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = nan_status_to_js(ctx, &status);
    if (JS_IsException(*details)) goto fail;
    SET(details, "espCode", JS_NewInt32(ctx, error));
    SET(details, "espName", JS_NewString(ctx, esp_err_to_name(error)));
    SET(details, "waitTimedOut", JS_NewBool(wait_timeout));
    (void)esp32_mquickjs_throw_native_error(ctx,
        wait_timeout || status.timed_out || error == ESP_ERR_TIMEOUT ? "WIFI_NAN_TIMEOUT" :
        status.closing && !status.error ? "WIFI_NAN_CLOSED" : "WIFI_NAN_FAILED",
        operation, "NAN operation did not complete; inspect session status", *details);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

static bool nan_open_options(JSContext *ctx, JSGCRef *input,
    wifi_nan_sync_config_t *config, uint32_t *timeout_ms, bool *usd)
{
    static const char *const keys[] = {
        "channel", "masterPreference", "scanTimeSeconds", "warmUpSeconds", "randomizeMac", "timeoutMs", "groupManagementProtection", "mode"
    };
    if (JS_IsUndefined(input->val)) return true;
    if (!esp32_mquickjs_validate_plain_options(ctx, input->val, "wifi.nan.open", keys, 8)) return false;
    JSGCRef ref;
    JSValue *field = JS_PushGCRef(ctx, &ref);
    uint32_t number;
    bool valid = false, sync_options = false;
#define FIELD(name) do { *field = JS_GetPropertyStr(ctx, input->val, name); if (JS_IsException(*field)) goto done; } while (0)
#define INTEGER(name, minimum, maximum, target) do { \
    FIELD(name); \
    if (!JS_IsUndefined(*field)) { \
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, minimum, maximum, &number)) goto invalid; \
        target = number; \
        if (strcmp(name, "timeoutMs")) sync_options = true; \
    } \
} while (0)
    FIELD("mode");
    if (!JS_IsUndefined(*field)) {
        static const char *const modes[] = {"synchronized", "unsynchronized"};
        size_t mode = 0;
        if (!esp32_mquickjs_value_to_enum(ctx, *field, modes, 2, &mode)) goto invalid;
        *usd = mode == 1;
    }
    INTEGER("channel", 1, UINT8_MAX, config->op_channel);
    INTEGER("masterPreference", 0, UINT8_MAX, config->master_pref);
    INTEGER("scanTimeSeconds", 0, UINT8_MAX, config->scan_time);
    INTEGER("warmUpSeconds", 0, UINT16_MAX, config->warm_up_sec);
    INTEGER("timeoutMs", 1, ESP32_MQUICKJS_NAN_MAX_STARTUP_MS, *timeout_ms);
    FIELD("randomizeMac");
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsBool(*field)) goto invalid;
        config->disable_random_mac = *field == JS_FALSE;
        sync_options = true;
    }
    FIELD("groupManagementProtection");
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsBool(*field)) goto invalid;
        config->group_mgmt_prot = *field == JS_TRUE;
        sync_options = true;
    }
    if (*usd && sync_options) goto invalid;
    valid = true;
    goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid NAN options");
done:
    JS_PopGCRef(ctx, &ref);
    return valid;
#undef INTEGER
#undef FIELD
}

JSValue js_wifi_nan_open(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.nan.open expects optional options");
    JSGCRef options_ref, result_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref), *result = JS_PushGCRef(ctx, &result_ref);
    *options = argc ? argv[0] : JS_UNDEFINED;
    uint32_t timeout_ms = 10000;
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    wifi_nan_sync_config_t config = WIFI_NAN_SYNC_CONFIG_DEFAULT();
    bool usd = false;
#else
    wifi_nan_sync_config_t config = {.op_channel = 6};
    bool usd = true;
#endif
    esp32_mquickjs_wifi_nan_session_t *session = NULL;
    if (!nan_open_options(ctx, &options_ref, &config, &timeout_ms, &usd)) goto fail;
    esp_err_t error = usd ? esp32_mquickjs_wifi_nan_session_create_usd(timeout_ms, &session) :
        esp32_mquickjs_wifi_nan_session_create(&config, timeout_ms, &session);
    if (error != ESP_OK) { (void)nan_error(ctx, "wifi.nan.open", session, error, false); goto fail; }
    *result = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_NAN_SESSION);
    if (JS_IsException(*result)) goto fail;
    JS_SetOpaque(ctx, *result, session);
    error = esp32_mquickjs_wifi_nan_session_activate(session);
    if (error != ESP_OK) {
        JS_SetOpaque(ctx, *result, NULL);
        (void)nan_error(ctx, "wifi.nan.open", session, error, false);
        goto fail;
    }
    /* Complete all fallible JS construction before native activation. */
    esp32_mquickjs_wireless_secure_zero(&config, sizeof(config));
    (void)esp32_mquickjs_wifi_nan_service();
    JSValue value = JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &options_ref);
    return value;
fail:
    esp32_mquickjs_wireless_secure_zero(&config, sizeof(config));
    esp32_mquickjs_wifi_nan_session_release(session);
    JS_PopGCRef(ctx, &result_ref); JS_PopGCRef(ctx, &options_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_nan_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "NAN status expects no arguments");
    esp32_mquickjs_wifi_nan_session_t *session = nan_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    esp32_mquickjs_wifi_nan_session_status_t status;
    (void)esp32_mquickjs_wifi_nan_session_status(session, &status);
    return nan_status_to_js(ctx, &status);
}

#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
static JSValue nan_tx_status_to_js(JSContext *ctx, const esp32_mquickjs_wifi_nan_tx_status_t *s)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "capacity", JS_NewUint32(ctx, ESP32_MQUICKJS_NAN_TX_CAPACITY));
    SET(result, "tracked", JS_NewUint32(ctx, s->tracked));
    SET(result, "unidentified", JS_NewUint32(ctx, s->unidentified));
    SET(result, "submissions", JS_NewUint32(ctx, s->submissions));
    SET(result, "rejected", JS_NewUint32(ctx, s->rejected));
    SET(result, "reservedBytes", JS_NewUint32(ctx, s->reserved_bytes));
    SET(result, "closing", JS_NewBool(s->closing));
    SET(result, "identityExhausted", JS_NewBool(s->identity_exhausted));
    SET(result, "error", s->error ? JS_NewInt32(ctx, s->error) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

#endif

