99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_nan/esp32_mquickjs_wifi_nan.c
JSValue js_wifi_nan_global_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "NAN status expects no arguments");
    esp32_mquickjs_wifi_nan_global_status_t status;
    esp32_mquickjs_wifi_nan_global_status(&status);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    esp32_mquickjs_wifi_nan_tx_status_t tx;
    esp32_mquickjs_wifi_nan_tx_status(&tx);
#endif
    esp32_mquickjs_wifi_nan_sdk_observer_status_t observer;
    esp32_mquickjs_wifi_nan_sdk_observer_status(&observer);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "active", JS_NewBool(status.active));
    SET(result, "handles", JS_NewUint32(ctx, status.handles));
    SET(result, "workers", JS_NewUint32(ctx, status.workers));
    SET(result, "serviceHandles", JS_NewUint32(ctx, status.service_handles));
    SET(result, "activeServices", JS_NewUint32(ctx, status.active_services));
    SET(result, "messageHandles", JS_NewUint32(ctx, status.message_handles));
    SET(result, "dataPathHandles", JS_NewUint32(ctx, status.path_handles));
    SET(result, "activeDataPaths", JS_NewUint32(ctx, status.active_paths));
    SET(result, "pairingHandles", JS_NewUint32(ctx, status.pairing_handles));
    SET(result, "activePairings", JS_NewUint32(ctx, status.active_pairings));
    SET(result, "runtimeClosing", JS_NewBool(status.runtime_closing));
    SET(result, "session", status.active ? nan_status_to_js(ctx, &status.session) : JS_NULL);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    SET(result, "tx", status.active && status.session.usd ? JS_NULL : nan_tx_status_to_js(ctx, &tx));
#else
    SET(result, "tx", JS_NULL);
#endif
    SET(result, "serviceCallbacks", JS_NewUint32(ctx, observer.service_callbacks));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_nan_capabilities(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "NAN capabilities expects no arguments");
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "apiVersion", JS_NewString(ctx, "wifi-nan/1"));
    SET(result, "stability", JS_NewString(ctx, "candidate"));
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    SET(result, "synchronized", JS_TRUE);
    SET(result, "peerQueries", JS_TRUE);
    SET(result, "maxPeerRecordsPerService", JS_NewInt32(ctx, NAN_MAX_PEERS_RECORD));
#else
    SET(result, "synchronized", JS_FALSE);
    SET(result, "peerQueries", JS_FALSE);
    SET(result, "maxPeerRecordsPerService", JS_NewInt32(ctx, 0));
#endif
#if CONFIG_ESP_WIFI_NAN_USD_ENABLE
    SET(result, "unsynchronized", JS_TRUE);
#else
    SET(result, "unsynchronized", JS_FALSE);
#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
    SET(result, "pinPairing", JS_TRUE);
    SET(result, "pinBootstrap", JS_TRUE);
    SET(result, "maxPendingPairingRequests", JS_NewInt32(ctx, 1));
    SET(result, "maxBootstrapPeersPerService", JS_NewInt32(ctx, ESP32_MQUICKJS_NAN_BOOTSTRAP_PEERS));
    SET(result, "cachedVerification", JS_TRUE);
    SET(result, "maxCachedPairings", JS_NewInt32(ctx, ESP32_MQUICKJS_NAN_CACHED_PAIRINGS));
    SET(result, "maxActivePairings", JS_NewInt32(ctx, 1));
    SET(result, "maxPairingHandles", JS_NewInt32(ctx, ESP32_MQUICKJS_NAN_PAIRING_HANDLES));
#else
    SET(result, "pinPairing", JS_FALSE);
    SET(result, "pinBootstrap", JS_FALSE);
    SET(result, "maxPendingPairingRequests", JS_NewInt32(ctx, 0));
    SET(result, "maxBootstrapPeersPerService", JS_NewInt32(ctx, 0));
    SET(result, "cachedVerification", JS_FALSE);
    SET(result, "maxCachedPairings", JS_NewInt32(ctx, 0));
    SET(result, "maxActivePairings", JS_NewInt32(ctx, 0));
    SET(result, "maxPairingHandles", JS_NewInt32(ctx, 0));
#endif
    SET(result, "radioOwnership", JS_NewString(ctx, "exclusive"));
    SET(result, "maxSessions", JS_NewUint32(ctx, ESP32_MQUICKJS_NAN_MAX_HANDLES));
    SET(result, "maxActiveSessions", JS_NewInt32(ctx, 1));
    SET(result, "maxStartupTimeoutMs", JS_NewUint32(ctx, ESP32_MQUICKJS_NAN_MAX_STARTUP_MS));
    SET(result, "maxServiceHandles", JS_NewUint32(ctx, ESP32_MQUICKJS_NAN_SERVICE_HANDLES));
    SET(result, "maxActiveServices", JS_NewInt32(ctx, ESP_WIFI_NAN_MAX_SVC_SUPPORTED));
    SET(result, "maxServiceSsiBytes", JS_NewInt32(ctx, ESP_WIFI_MAX_SVC_SSI_LEN));
    SET(result, "maxReceivedSsiBytes", JS_NewInt32(ctx, ESP_WIFI_MAX_FUP_SSI_LEN));
    SET(result, "maxMessageHandles", JS_NewInt32(ctx, ESP32_MQUICKJS_NAN_MESSAGE_HANDLES));
    SET(result, "maxActiveMessages", JS_NewInt32(ctx, 1));
    SET(result, "maxSentSsiBytes", JS_NewInt32(ctx, ESP_WIFI_MAX_FUP_SSI_LEN));
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    SET(result, "dataPaths", JS_TRUE);
    SET(result, "maxActiveDataPaths", JS_NewInt32(ctx, ESP_WIFI_NAN_DATAPATH_MAX_PEERS));
    SET(result, "maxDataPathHandles", JS_NewInt32(ctx, ESP32_MQUICKJS_NAN_PATH_HANDLES));
    SET(result, "incomingDataPathTimeoutMs", JS_NewInt32(ctx, 10000));
    SET(result, "vendorAttributes", JS_TRUE);
    SET(result, "maxVendorBodyBytes", JS_NewInt32(ctx, NAN_VENDOR_IE_MAX_BODY_LEN));
#else
    SET(result, "dataPaths", JS_FALSE);
    SET(result, "maxActiveDataPaths", JS_NewInt32(ctx, 0));
    SET(result, "maxDataPathHandles", JS_NewInt32(ctx, 0));
    SET(result, "incomingDataPathTimeoutMs", JS_NewInt32(ctx, 0));
    SET(result, "vendorAttributes", JS_FALSE);
    SET(result, "maxVendorBodyBytes", JS_NewInt32(ctx, 0));
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE && CONFIG_ESP_WIFI_NAN_SECURITY
    SET(result, "security", JS_TRUE);
    SET(result, "securityReason", JS_NULL);
#else
    SET(result, "security", JS_FALSE);
    SET(result, "securityReason", JS_NewString(ctx, "CONFIG_ESP_WIFI_NAN_SECURITY disabled"));
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE && CONFIG_ESP_WIFI_NAN_SECURITY
    SET(result, "maxCredentials", JS_NewInt32(ctx, ESP_WIFI_NAN_MAX_CREDS_PER_SVC));
#else
    SET(result, "maxCredentials", JS_NewInt32(ctx, 0));
#endif
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

#include "esp32_mquickjs_wifi_nan_service_public.inc"
#include "esp32_mquickjs_wifi_nan_query_public.inc"
#include "esp32_mquickjs_wifi_nan_message_public.inc"
#if CONFIG_ESP_WIFI_NAN_PAIRING
#include "esp32_mquickjs_wifi_nan_pairing_public.inc"
#endif
static void nan_destroy(esp32_mquickjs_future_driver_state_t *state);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
#include "esp32_mquickjs_wifi_nan_path_public.inc"
#endif

static void nan_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (!state) return;
    esp32_mquickjs_wifi_nan_session_release(state->session);
    esp32_mquickjs_wifi_nan_discovery_release(state->discovery);
    esp32_mquickjs_wifi_nan_message_release(state->message);
#if CONFIG_ESP_WIFI_NAN_PAIRING
    if (state->operation == NAN_PAIRING_RECEIVE) esp32_mquickjs_wifi_nan_pairing_unreserve(state->pairing);
    esp32_mquickjs_wifi_nan_pairing_release(state->pairing);
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (state->operation == NAN_PATH_RECEIVE) esp32_mquickjs_wifi_nan_path_unreserve(state->path);
    esp32_mquickjs_wifi_nan_path_release(state->path);
    if (state->response) {
        esp32_mquickjs_wireless_secure_zero(state->response, sizeof(*state->response));
        esp32_mquickjs_memory_payload_free(state->response);
    }

#endif
    esp32_mquickjs_memory_payload_free(state);
}

