99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_nan/esp32_mquickjs_wifi_nan.c
static bool nan_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out, nan_operation_t operation)
{
    *out = NULL;
    if (argc > 1) { JS_ThrowTypeError(ctx, "NAN method expects optional timeout options"); return false; }
    bool child = operation == NAN_SERVICE_READY || operation == NAN_SERVICE_CLOSE;
    bool connection = false, pairing = false;
#if CONFIG_ESP_WIFI_NAN_PAIRING
    child = child || operation == NAN_PAIRING_CREDENTIALS || operation == NAN_PAIRING_RECEIVE;
    pairing = operation == NAN_PAIRING_READY || operation == NAN_PAIRING_CLOSE;
    esp32_mquickjs_wifi_nan_pairing_t *pair = pairing ? nan_pairing_receiver(ctx, self->val) : NULL;
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    child = child || operation == NAN_PATH_RECEIVE;
    connection = operation == NAN_PATH_READY || operation == NAN_PATH_CLOSE;
    esp32_mquickjs_wifi_nan_path_t *path = connection ? nan_path_receiver(ctx, self->val) : NULL;
#endif
    esp32_mquickjs_wifi_nan_session_t *session = child || connection || pairing ? NULL : nan_receiver(ctx, self->val);
    esp32_mquickjs_wifi_nan_discovery_t *discovery = child ? nan_service_receiver(ctx, self->val) : NULL;
    if (!session && !discovery
#if CONFIG_ESP_WIFI_NAN_PAIRING
        && !pair
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
        && !path
#endif
    ) return false;
    /* Retain before any option getter can run JS or trigger GC. */
    bool retained;
#if CONFIG_ESP_WIFI_NAN_PAIRING
    if (pairing) retained = esp32_mquickjs_wifi_nan_pairing_retain(pair);
    else
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (connection) retained = esp32_mquickjs_wifi_nan_path_retain(path);
    else
#endif
        retained = child ? esp32_mquickjs_wifi_nan_discovery_retain(discovery) : esp32_mquickjs_wifi_nan_session_retain(session);
    if (!retained) {
        JS_ThrowInternalError(ctx, "NAN reference exhausted"); return false;
    }
    uint32_t timeout_ms = 10000;
    bool valid = true;
    if (argc && !JS_IsUndefined(argv[0].val)) {
        static const char *const keys[] = {"timeoutMs"};
        valid = esp32_mquickjs_validate_plain_options(ctx, argv[0].val, nan_operation_name(operation), keys, 1);
        if (valid) {
            JSGCRef ref;
            JSValue *field = JS_PushGCRef(ctx, &ref);
            *field = JS_GetPropertyStr(ctx, argv[0].val, "timeoutMs");
            valid = !JS_IsException(*field) && (JS_IsUndefined(*field) ||
                esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 120000, &timeout_ms));
            JS_PopGCRef(ctx, &ref);
        }
    }
    if (!valid) {
        esp32_mquickjs_wifi_nan_session_release(session);
        esp32_mquickjs_wifi_nan_discovery_release(discovery);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
        esp32_mquickjs_wifi_nan_path_release(path);
#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
        esp32_mquickjs_wifi_nan_pairing_release(pair);
#endif
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid NAN timeout options");
        return false;
    }
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!state) {
        esp32_mquickjs_wifi_nan_session_release(session); esp32_mquickjs_wifi_nan_discovery_release(discovery);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
        esp32_mquickjs_wifi_nan_path_release(path);
#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
        esp32_mquickjs_wifi_nan_pairing_release(pair);
#endif
        JS_ThrowOutOfMemory(ctx); return false;
    }
    state->session = session; state->operation = operation; state->timeout_ms = timeout_ms;
    state->discovery = discovery;
#if CONFIG_ESP_WIFI_NAN_PAIRING
    state->pairing = pair;
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    state->path = path;
#endif
    *out = state;
    return true;
}

static bool nan_ready_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_READY); }
static bool nan_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_CLOSE); }
static bool nan_service_ready_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_SERVICE_READY); }
static bool nan_service_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_SERVICE_CLOSE); }

static bool nan_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)ctx; (void)runtime; (void)token;
#if CONFIG_ESP_WIFI_NAN_PAIRING
    if (state->operation == NAN_PAIRING_CREDENTIALS) {
        esp_err_t error = esp32_mquickjs_wifi_nan_discovery_credentials_request(state->discovery, &state->credentials_revision);
        if (error) { (void)nan_service_error(ctx, nan_operation_name(state->operation), state->discovery, error, false); return false; }
    }
    if (state->operation == NAN_PAIRING_RECEIVE) {
        esp_err_t error = esp32_mquickjs_wifi_nan_pairing_receive(state->discovery, &state->pairing);
        if (error) { (void)nan_service_error(ctx, nan_operation_name(state->operation), state->discovery, error, false); return false; }
    }
    if (state->operation == NAN_PAIRING_CLOSE) esp32_mquickjs_wifi_nan_pairing_close(state->pairing, false);
#endif
    if (state->operation == NAN_CLOSE) esp32_mquickjs_wifi_nan_session_close(state->session, false);
    if (state->operation == NAN_SERVICE_CLOSE) esp32_mquickjs_wifi_nan_discovery_close(state->discovery);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (state->operation == NAN_PATH_CLOSE) esp32_mquickjs_wifi_nan_path_close(state->path, false);
    if (state->operation == NAN_PATH_RESPOND) {
        esp_err_t error = esp32_mquickjs_wifi_nan_path_respond(state->path, state->response->accept,
            state->response->ssi, state->response->length);
        if (error) { (void)nan_path_error(ctx, state->path, nan_operation_name(state->operation), error, false); return false; }
    }
    if (state->operation == NAN_PATH_RECEIVE) {
        esp_err_t error = esp32_mquickjs_wifi_nan_path_receive(state->discovery, &state->path);
        if (error) { (void)nan_service_error(ctx, nan_operation_name(state->operation), state->discovery, error, false); return false; }
    }

#endif
    if (state->message) {
        esp_err_t error = esp32_mquickjs_wifi_nan_message_activate(state->message);
        if (error) { (void)nan_message_error(ctx, state->message, error, false); return false; }
    }
    (void)esp32_mquickjs_wifi_nan_service();
    return true;
}

static esp32_mquickjs_future_poll_t nan_poll(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->cancelled) return ESP32_MQUICKJS_FUTURE_READY;
#if CONFIG_ESP_WIFI_NAN_PAIRING
    if (state->operation == NAN_PAIRING_CREDENTIALS) {
        (void)esp32_mquickjs_wifi_nan_service();
        state->credentials_error = esp32_mquickjs_wifi_nan_discovery_credentials_read(state->discovery,
            state->credentials_revision, &state->credentials_ready, &state->credentials);
        return state->credentials_ready || state->credentials_error ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
    }
    if (state->operation == NAN_PAIRING_RECEIVE) {
        (void)esp32_mquickjs_wifi_nan_service();
        if (state->pairing) return ESP32_MQUICKJS_FUTURE_READY;
        esp_err_t error = esp32_mquickjs_wifi_nan_pairing_receive(state->discovery, &state->pairing);
        return error || state->pairing ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
    }
    if (state->pairing) {
        (void)esp32_mquickjs_wifi_nan_service();
        esp32_mquickjs_wifi_nan_pairing_status_t status;
        esp32_mquickjs_wifi_nan_pairing_status(state->pairing, &status);
        return (state->operation == NAN_PAIRING_CLOSE ? status.retired : status.ready || status.closing || status.error) ?
            ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
    }
#endif
    (void)esp32_mquickjs_wifi_nan_service();
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (state->operation == NAN_PATH_RECEIVE) {
        if (state->path) return ESP32_MQUICKJS_FUTURE_READY;
        esp_err_t error = esp32_mquickjs_wifi_nan_path_receive(state->discovery, &state->path);
        return error || state->path ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
    }
    if (state->path) {
        esp32_mquickjs_wifi_nan_path_status_t status;
        esp32_mquickjs_wifi_nan_path_status(state->path, &status);
        bool close = state->operation == NAN_PATH_CLOSE ||
            (state->operation == NAN_PATH_RESPOND && !state->response->accept);
        return (close ? status.retired : status.ready || status.closing || status.error) ?
            ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
    }
#endif
    if (state->message) {
        esp32_mquickjs_wifi_nan_message_status_t status;
        esp32_mquickjs_wifi_nan_message_status(state->message, &status);
        return status.done ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
    }
    if (state->discovery) {
        esp32_mquickjs_wifi_nan_discovery_status_t status;
        esp32_mquickjs_wifi_nan_discovery_status(state->discovery, &status);
        bool ready = state->operation == NAN_SERVICE_CLOSE ? status.retired : status.ready || status.error || status.closing;
        return ready ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
    }
    esp32_mquickjs_wifi_nan_session_status_t status;
    (void)esp32_mquickjs_wifi_nan_session_status(state->session, &status);
    bool ready = state->operation == NAN_CLOSE ? status.retired : status.ready || status.error || status.closing;
    return ready ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue nan_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
#if CONFIG_ESP_WIFI_NAN_PAIRING
    if (state->operation == NAN_PAIRING_CREDENTIALS) {
        if (state->credentials_error || !state->credentials_ready)
            return nan_service_error(ctx, nan_operation_name(state->operation), state->discovery,
                state->credentials_error, false);
        return nan_credentials_to_js(ctx, &state->credentials);
    }
    if (state->operation == NAN_PAIRING_RECEIVE) return nan_pairing_receive_finish(ctx, state);
    if (state->pairing) {
        esp32_mquickjs_wifi_nan_pairing_status_t status;
        esp32_mquickjs_wifi_nan_pairing_status(state->pairing, &status);
        if (state->operation == NAN_PAIRING_CLOSE && status.retired) return JS_UNDEFINED;
        if (state->operation == NAN_PAIRING_READY && status.ready && !status.closing && !status.error)
            return nan_pairing_status_to_js(ctx, &status);
        return nan_pairing_error(ctx, state->pairing, nan_operation_name(state->operation), ESP_OK, false);
    }
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (state->operation == NAN_PATH_RECEIVE) return nan_path_receive_finish(ctx, state);
    if (state->path) {
        esp32_mquickjs_wifi_nan_path_status_t status;
        esp32_mquickjs_wifi_nan_path_status(state->path, &status);
        if (state->operation == NAN_PATH_CLOSE && status.retired) return JS_UNDEFINED;
        if (state->operation == NAN_PATH_RESPOND && !state->response->accept && status.retired && !status.error)
            return nan_path_status_to_js(ctx, &status);
        if (state->operation != NAN_PATH_CLOSE && status.ready && !status.error)
            return nan_path_status_to_js(ctx, &status);
        return nan_path_error(ctx, state->path, nan_operation_name(state->operation), ESP_OK, false);
    }
#endif
    if (state->message) {
        esp32_mquickjs_wifi_nan_message_status_t status;
        esp32_mquickjs_wifi_nan_message_status(state->message, &status);
        if (status.done && !status.error && status.tx.tx_done && status.tx.tx_succeeded)
            return nan_message_result_to_js(ctx, &status);
        return nan_message_error(ctx, state->message, ESP_OK, false);
    }
    if (state->discovery) {
        esp32_mquickjs_wifi_nan_discovery_status_t status;
        esp32_mquickjs_wifi_nan_discovery_status(state->discovery, &status);
        if (state->operation == NAN_SERVICE_CLOSE && status.retired) return JS_UNDEFINED;
        if (state->operation == NAN_SERVICE_READY && status.ready && !status.error && !status.closing)
            return nan_service_status_to_js(ctx, &status);
        return nan_service_error(ctx, nan_operation_name(state->operation), state->discovery, ESP_OK, false);
    }
    esp32_mquickjs_wifi_nan_session_status_t status;
    (void)esp32_mquickjs_wifi_nan_session_status(state->session, &status);
    if (state->operation == NAN_CLOSE) {
        if (status.retired) return JS_UNDEFINED;
    } else if (status.ready && !status.error && !status.closing) {
        /* Snapshot conversion never consumes the ready state or its owner. */
        return nan_status_to_js(ctx, &status);
    }
    return nan_error(ctx, nan_operation_name(state->operation), state->session, ESP_OK, false);
}

static esp32_mquickjs_cancel_result_t nan_cancel_wait(esp32_mquickjs_future_driver_state_t *state)
{
    state->cancelled = true;
    if (state->message) esp32_mquickjs_wifi_nan_message_cancel(state->message, false);
    /* Cancellation before start has no native effect. A started close already
     * belongs to the registry; cancelling a ready wait does not stop discovery. */
    return ESP32_MQUICKJS_CANCELLED;
}
static uint32_t nan_timeout(const esp32_mquickjs_future_driver_state_t *state)
{ return state->timeout_ms; }
static JSValue nan_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t timeout_ms)
{
    (void)timeout_ms;
#if CONFIG_ESP_WIFI_NAN_PAIRING
    if (state->operation == NAN_PAIRING_RECEIVE) return JS_NULL;
    if (state->pairing) return nan_pairing_error(ctx, state->pairing, nan_operation_name(state->operation), ESP_ERR_TIMEOUT, true);
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (state->operation == NAN_PATH_RECEIVE) return JS_NULL;
    if (state->path) return nan_path_error(ctx, state->path, nan_operation_name(state->operation), ESP_ERR_TIMEOUT, true);

#endif
    if (state->message) {
        state->cancelled = true;
        esp32_mquickjs_wifi_nan_message_cancel(state->message, true);
        return nan_message_error(ctx, state->message, ESP_ERR_TIMEOUT, true);
    }
    (void)nan_cancel_wait(state);
    if (state->discovery) return nan_service_error(ctx, nan_operation_name(state->operation), state->discovery, ESP_ERR_TIMEOUT, true);
    return nan_error(ctx, nan_operation_name(state->operation), state->session, ESP_ERR_TIMEOUT, true);
}
#define NAN_DRIVER(capture_fn) { .memory_owner = "wireless.future", .capture = capture_fn, .start = nan_start, \
    .poll = nan_poll, .finish = nan_finish, .cancel = nan_cancel_wait, .destroy = nan_destroy, \
    .timeout_ms = nan_timeout, .on_timeout = nan_on_timeout }
static const esp32_mquickjs_future_driver_t s_nan_ready_driver = NAN_DRIVER(nan_ready_capture);
static const esp32_mquickjs_future_driver_t s_nan_close_driver = NAN_DRIVER(nan_close_capture);
static const esp32_mquickjs_future_driver_t s_nan_service_ready_driver = NAN_DRIVER(nan_service_ready_capture);
static const esp32_mquickjs_future_driver_t s_nan_service_close_driver = NAN_DRIVER(nan_service_close_capture);
static const esp32_mquickjs_future_driver_t s_nan_service_send_driver = NAN_DRIVER(nan_send_capture);
#if CONFIG_ESP_WIFI_NAN_PAIRING
static bool nan_pairing_receive_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_PAIRING_RECEIVE); }
static const esp32_mquickjs_future_driver_t s_nan_pairing_receive_driver = NAN_DRIVER(nan_pairing_receive_capture);
static bool nan_pairing_credentials_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_PAIRING_CREDENTIALS); }
static const esp32_mquickjs_future_driver_t s_nan_pairing_credentials_driver = NAN_DRIVER(nan_pairing_credentials_capture);
static bool nan_pairing_ready_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_PAIRING_READY); }
static bool nan_pairing_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_PAIRING_CLOSE); }
static const esp32_mquickjs_future_driver_t s_nan_pairing_ready_driver = NAN_DRIVER(nan_pairing_ready_capture);
static const esp32_mquickjs_future_driver_t s_nan_pairing_close_driver = NAN_DRIVER(nan_pairing_close_capture);
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
static bool nan_path_ready_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_PATH_READY); }
static bool nan_path_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_PATH_CLOSE); }
static bool nan_path_receive_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return nan_capture(ctx, self, argc, argv, out, NAN_PATH_RECEIVE); }
static const esp32_mquickjs_future_driver_t s_nan_path_ready_driver = NAN_DRIVER(nan_path_ready_capture);
static const esp32_mquickjs_future_driver_t s_nan_path_close_driver = NAN_DRIVER(nan_path_close_capture);
static const esp32_mquickjs_future_driver_t s_nan_path_receive_driver = NAN_DRIVER(nan_path_receive_capture);
static const esp32_mquickjs_future_driver_t s_nan_path_respond_driver = NAN_DRIVER(nan_path_respond_capture);

#endif

