99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_nan/esp32_mquickjs_wifi_nan.c
static JSValue nan_call(JSContext *ctx, JSValue *receiver, int argc, JSValue *argv, const char *name)
{
    JSGCRef self_ref, method_ref;
    JSValue *self = JS_PushGCRef(ctx, &self_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *self = *receiver;
    *method = JS_GetPropertyStr(ctx, *self, name);
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *self, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &self_ref);
    return result;
}

JSValue js_wifi_nan_ready(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "ready"); }
JSValue js_wifi_nan_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "close"); }
JSValue js_wifi_nan_service_ready(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "ready"); }
JSValue js_wifi_nan_service_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "close"); }
JSValue js_wifi_nan_service_send(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "send"); }
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
JSValue js_wifi_nan_path_ready(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "ready"); }
JSValue js_wifi_nan_path_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "close"); }
JSValue js_wifi_nan_path_respond(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "respond"); }
JSValue js_wifi_nan_path_receive(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "receiveDataPath"); }

#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
JSValue js_wifi_nan_pairing_receive(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "receivePairing"); }
JSValue js_wifi_nan_pairing_credentials(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "pairingCredentials"); }
JSValue js_wifi_nan_pairing_ready(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "ready"); }
JSValue js_wifi_nan_pairing_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return nan_call(ctx, self, argc, argv, "close"); }
#endif
JSValue js_wifi_nan_cancel(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "NAN cancel expects no arguments");
    esp32_mquickjs_wifi_nan_session_t *session = nan_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    esp32_mquickjs_wifi_nan_session_close(session, false);
    (void)esp32_mquickjs_wifi_nan_service();
    return JS_UNDEFINED;
}

bool esp32_mquickjs_init_wifi_nan_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, object_ref, proto_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *proto = JS_PushGCRef(ctx, &proto_ref), *method = JS_PushGCRef(ctx, &method_ref);
    bool ok = false;
    *global = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiNanSession");
    if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "ready");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_ready_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_close_driver)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiNanService");
    if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "ready");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_service_ready_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_service_close_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "send");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_service_send_driver)) goto done;
#if CONFIG_ESP_WIFI_NAN_PAIRING
    *method = JS_GetPropertyStr(ctx, *proto, "receivePairing");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_pairing_receive_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "pairingCredentials");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_pairing_credentials_driver)) goto done;
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    *method = JS_GetPropertyStr(ctx, *proto, "receiveDataPath");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_path_receive_driver)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiNanDataPath");
    if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "ready");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_path_ready_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_path_close_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "respond");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_path_respond_driver)) goto done;

#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
    *object = JS_GetPropertyStr(ctx, *global, "WiFiNanPairing");
    if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "ready");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_pairing_ready_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_nan_pairing_close_driver)) goto done;
#endif
    ok = true;
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register NAN runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &proto_ref);
    JS_PopGCRef(ctx, &object_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
